Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.IsMirrored
States if the structural section of the element is mirrored.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.Section
Structural section of the element.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.Normal
The local Z direction of the element section in the start point of the curve.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.EndShortening
Cutback or extension at element curve end.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.StartShortening
Cutback or extension at element curve start.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.ZOffset
Z offset.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.YOffset
Y offset.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.ZJust
Z justification (ref axis).
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.YJust
Y justification (ref axis).
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.CenterCurve
The curve lying in the geometrical center of the element.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.Curve
The definition curve of the element.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.#ctor
Creates empty StructuralElementDefinitionData object.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData
Class containing information about section and position of the structural element.
Since:
2018